src/conf/AccumulationRegisters/ОстаткиПроцедур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиПроцедур</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Процедура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Процедуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияНазначений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/conf/InformationRegisters/уп_ГрафикРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>уп_ГрафикРаботы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процедура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Процедуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/conf/Enums/уп_СостоянияГрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>уп_СостоянияГрафика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ручной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматический</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/conf/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОказываемыеПроцедуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Процедура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Процедуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/conf/CommonModules/уп_РаботаСГрафикомСервер/Ext/Module.bsl
Функция ПолучитьКлиентовСОстаткамиПроцедур() Экспорт
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Клиент
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВложенныйЗапрос.Клиент КАК Клиент,
	               |		ВложенныйЗапрос.Процедура КАК Процедура,
	               |		СУММА(ВложенныйЗапрос.КоличествоОстаток) КАК КоличествоОстаток
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			ОстаткиПроцедурОстатки.Клиент КАК Клиент,
	               |			ОстаткиПроцедурОстатки.Процедура КАК Процедура,
	               |			ОстаткиПроцедурОстатки.КоличествоОстаток КАК КоличествоОстаток
	               |		ИЗ
	               |			РегистрНакопления.ОстаткиПроцедур.Остатки КАК ОстаткиПроцедурОстатки
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			уп_ГрафикРаботы.Клиент,
	               |			уп_ГрафикРаботы.Назначение,
	               |			СУММА(-1)
	               |		ИЗ
	               |			РегистрСведений.уп_ГрафикРаботы КАК уп_ГрафикРаботы
	               |		ГДЕ
	               |			уп_ГрафикРаботы.Состояние <> ЗНАЧЕНИЕ(Перечисление.уп_СостоянияГрафика.Закрыт)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			уп_ГрафикРаботы.Клиент,
	               |			уп_ГрафикРаботы.Назначение) КАК ВложенныйЗапрос
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВложенныйЗапрос.Клиент,
	               |		ВложенныйЗапрос.Процедура) КАК ВложенныйЗапрос
	               |ГДЕ
	               |	ВложенныйЗапрос.КоличествоОстаток > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Клиент";	
	Запрос = Новый Запрос (ТекстЗапроса);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат.ВыгрузитьКолонку("Клиент");			
КонецФункции

Функция ПолучитьКлиентовСОстаткамиПроцедурТЗ(Параметры) Экспорт
	ТекстЗапроса = "ВЫБРАТЬ
	               |	КлиентыИПроцедуры.Клиент,
	               |	КлиентыИПроцедуры.Процедура,
	               |	СотрудникиОказываемыеПроцедуры.Ссылка КАК Сотрудник
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВложенныйЗапрос.Клиент КАК Клиент,
	               |		ВложенныйЗапрос.Процедура КАК Процедура,
	               |		СУММА(ВложенныйЗапрос.КоличествоОстаток) КАК КоличествоОстаток
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			ОстаткиПроцедурОстатки.Клиент КАК Клиент,
	               |			ОстаткиПроцедурОстатки.Процедура КАК Процедура,
	               |			ОстаткиПроцедурОстатки.КоличествоОстаток КАК КоличествоОстаток
	               |		ИЗ
	               |			РегистрНакопления.ОстаткиПроцедур.Остатки(&Период, Процедура В (&Процедуры)) КАК ОстаткиПроцедурОстатки
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			уп_ГрафикРаботы.Клиент,
	               |			уп_ГрафикРаботы.Назначение,
	               |			СУММА(-1)
	               |		ИЗ
	               |			РегистрСведений.уп_ГрафикРаботы КАК уп_ГрафикРаботы
	               |		ГДЕ
	               |			уп_ГрафикРаботы.Состояние <> ЗНАЧЕНИЕ(Перечисление.уп_СостоянияГрафика.Закрыт)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			уп_ГрафикРаботы.Клиент,
	               |			уп_ГрафикРаботы.Назначение) КАК ВложенныйЗапрос
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВложенныйЗапрос.Клиент,
	               |		ВложенныйЗапрос.Процедура) КАК КлиентыИПроцедуры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники.ОказываемыеПроцедуры КАК СотрудникиОказываемыеПроцедуры
	               |		ПО КлиентыИПроцедуры.Процедура = СотрудникиОказываемыеПроцедуры.Процедура
	               |ГДЕ
	               |	КлиентыИПроцедуры.КоличествоОстаток > 0
	               |	И СотрудникиОказываемыеПроцедуры.Ссылка В(&СвободныеСотрудники)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КлиентыИПроцедуры.Клиент,
	               |	КлиентыИПроцедуры.Процедура,
	               |	СотрудникиОказываемыеПроцедуры.Ссылка";	
	Запрос = Новый Запрос (ТекстЗапроса);
	Запрос.УстановитьПараметр("Процедуры", Справочники.Помещения.ПолучитьМассивПроцедурПоПомещению(Параметры.Помещение));
	Запрос.УстановитьПараметр("Период", Параметры.Время);
	Запрос.УстановитьПараметр("СвободныеСотрудники", РегистрыСведений.уп_ГрафикРаботы.ПолучитьСвободныхСотрудниковНаПериод(Параметры.Время, Параметры.Время + 45*60)); //TODO: Придумать что-нибудь с периодом
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;			
КонецФункции
